app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Lunch"], ["room_number", 3], ["created_at", "2017-10-16 18:11:48.585542"], ["updated_at", "2017-10-16 18:11:48.585542"]]
---
  def create
    # byebug
    @school_class = SchoolClass.create(school_class_params(:title, :room_number))

UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", nil], ["room_number", nil], ["updated_at", "2017-10-16 18:27:38.173626"], ["id", 2]]
---
  def update
    # byebug
    @school_class.update(params.require(:school_class))