app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Laura"], ["last_name", "Kim"], ["created_at", "2017-10-16 18:38:19.666028"], ["updated_at", "2017-10-16 18:38:19.666028"]]
---
  def create
    # byebug
    @student = Student.create(student_params(:first_name, :last_name))

UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2017-10-16 18:44:00.473618"], ["id", 1]]
---
  def update
    @student.update(params.require(:student))